/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50527
Source Host           : localhost:3306
Source Database       : boot_crm

Target Server Type    : MYSQL
Target Server Version : 50527
File Encoding         : 65001

Date: 2019-12-18 17:03:40
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `customer`
-- ----------------------------
DROP TABLE IF EXISTS `customer`;
CREATE TABLE `customer` (
  `cust_id` int(32) NOT NULL AUTO_INCREMENT COMMENT '�ͻ����(����)',
  `cust_name` varchar(50) DEFAULT NULL,
  `cust_source` varchar(50) DEFAULT NULL COMMENT '�ͻ���Ϣ��Դ',
  `cust_industry` varchar(50) DEFAULT NULL COMMENT '�ͻ�������ҵ',
  `cust_level` varchar(32) DEFAULT NULL COMMENT '�ͻ�����',
  `cust_linkman` varchar(50) DEFAULT NULL COMMENT '��ϵ��',
  `cust_phone` varchar(64) DEFAULT NULL COMMENT '�̶��绰',
  `cust_mobile` varchar(16) DEFAULT NULL COMMENT '�ƶ��绰',
  `cust_zipcode` varchar(10) DEFAULT NULL COMMENT '��������',
  `cust_address` varchar(100) DEFAULT NULL COMMENT '��ϵ��ַ',
  `cust_createtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`cust_id`)
) ENGINE=InnoDB AUTO_INCREMENT=69 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of customer
-- ----------------------------
INSERT INTO `customer` VALUES ('1', '小旺旺', '网络营销', '教育培训', '普通用户', '好友', '7758250', '188', '075525', '河北省邯郸市', '2019-12-09 21:25:45');
INSERT INTO `customer` VALUES ('2', '小木子', '电话营销', '电子商务', 'VIP用户', '同事', '7758523', '123', '075526', '河北省保定市', '2019-12-09 21:26:08');
INSERT INTO `customer` VALUES ('3', '学子', '网络营销', '酒店管理', '普通用户', '同学', '7758524', '456', '075564', '河北省石家庄市', '2019-12-09 20:14:53');
INSERT INTO `customer` VALUES ('4', '夏子', '电话营销', '教育培训', 'VIP用户', '情人', '4164656', '789', '058898', '山西省太原市', '2019-12-07 21:41:16');
INSERT INTO `customer` VALUES ('5', '木子', '网络营销', '电子商务', 'VIP用户', '同学', '5445645', '153', '456456', '广东省深圳市', '2019-12-07 21:41:19');
INSERT INTO `customer` VALUES ('6', '小炒', '网络营销', '电子商务', '普通用户', '好友', '4546546', '445', '46465465', '河北省邯郸市', '2019-12-07 21:47:50');
INSERT INTO `customer` VALUES ('7', '小红', '电话营销', '酒店管理', '普通用户', '好友', '6546566', '156', '1654664', '河南省郑州市', '2019-12-07 21:48:40');
INSERT INTO `customer` VALUES ('9', '大可爱', '网络营销', '教育培训', 'VIP用户', '小明', '123312', '456654', '02554', '北京市朝阳区', '2019-12-08 19:22:23');
INSERT INTO `customer` VALUES ('10', '小乖乖', '电话营销', '教育培训', '普通用户', '大黄', '123', '54321', '12341', '北京市顺义区', '2019-12-08 19:23:46');
INSERT INTO `customer` VALUES ('11', '小小明', '网络营销', '电子商务', 'VIP用户', '23', '213', '456654', '02554', '河南省周口市', '2019-12-08 19:24:24');
INSERT INTO `customer` VALUES ('12', '斯柯达', '网络营销', '电子商务', 'VIP用户', '小怪', '撒', '是', 'as', '阿萨德', '2019-12-10 11:08:13');
INSERT INTO `customer` VALUES ('13', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:50');
INSERT INTO `customer` VALUES ('14', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:52');
INSERT INTO `customer` VALUES ('15', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:52');
INSERT INTO `customer` VALUES ('16', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:52');
INSERT INTO `customer` VALUES ('17', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:52');
INSERT INTO `customer` VALUES ('18', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:53');
INSERT INTO `customer` VALUES ('19', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:53');
INSERT INTO `customer` VALUES ('20', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:53');
INSERT INTO `customer` VALUES ('21', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:54');
INSERT INTO `customer` VALUES ('22', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:54');
INSERT INTO `customer` VALUES ('23', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:55');
INSERT INTO `customer` VALUES ('24', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:55');
INSERT INTO `customer` VALUES ('25', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:55');
INSERT INTO `customer` VALUES ('26', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:56');
INSERT INTO `customer` VALUES ('27', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:56');
INSERT INTO `customer` VALUES ('28', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:56');
INSERT INTO `customer` VALUES ('29', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:56');
INSERT INTO `customer` VALUES ('30', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:57');
INSERT INTO `customer` VALUES ('31', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:57');
INSERT INTO `customer` VALUES ('32', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:57');
INSERT INTO `customer` VALUES ('33', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:57');
INSERT INTO `customer` VALUES ('34', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:57');
INSERT INTO `customer` VALUES ('35', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:58');
INSERT INTO `customer` VALUES ('36', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:58');
INSERT INTO `customer` VALUES ('37', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:58');
INSERT INTO `customer` VALUES ('38', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:59');
INSERT INTO `customer` VALUES ('39', '小超', '电话营销', '酒店管理', '普通用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:11:59');
INSERT INTO `customer` VALUES ('40', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:49');
INSERT INTO `customer` VALUES ('41', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:49');
INSERT INTO `customer` VALUES ('42', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:49');
INSERT INTO `customer` VALUES ('43', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:49');
INSERT INTO `customer` VALUES ('44', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:50');
INSERT INTO `customer` VALUES ('45', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:50');
INSERT INTO `customer` VALUES ('46', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:50');
INSERT INTO `customer` VALUES ('47', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:51');
INSERT INTO `customer` VALUES ('48', '超子', '网络营销', '教育培训', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:12:51');
INSERT INTO `customer` VALUES ('49', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:21');
INSERT INTO `customer` VALUES ('50', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:21');
INSERT INTO `customer` VALUES ('51', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:21');
INSERT INTO `customer` VALUES ('52', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:22');
INSERT INTO `customer` VALUES ('53', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:22');
INSERT INTO `customer` VALUES ('54', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:22');
INSERT INTO `customer` VALUES ('55', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:22');
INSERT INTO `customer` VALUES ('56', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:22');
INSERT INTO `customer` VALUES ('57', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:23');
INSERT INTO `customer` VALUES ('58', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:32');
INSERT INTO `customer` VALUES ('59', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:32');
INSERT INTO `customer` VALUES ('60', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:32');
INSERT INTO `customer` VALUES ('61', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:32');
INSERT INTO `customer` VALUES ('62', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:33');
INSERT INTO `customer` VALUES ('63', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:33');
INSERT INTO `customer` VALUES ('65', '小陌陌', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:40:29');
INSERT INTO `customer` VALUES ('66', '小赫', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:13:34');
INSERT INTO `customer` VALUES ('68', '小赫子', '网络营销', '电子商务', 'VIP用户', '同学', '123', '123132', '1651', '河北省保定市', '2019-12-10 11:37:51');

-- ----------------------------
-- Table structure for `sys_user`
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user` (
  `user_id` int(32) NOT NULL AUTO_INCREMENT COMMENT '�û�id',
  `user_code` varchar(32) NOT NULL COMMENT '�û��˺�',
  `user_name` varchar(50) NOT NULL COMMENT '�û�����',
  `user_password` varchar(32) NOT NULL COMMENT '�û�����',
  `user_state` int(1) NOT NULL COMMENT '1:����,0:��ͣ',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES ('1', 'admin', '小小', '123', '1');
